{
  "id": "2928",
  "author": "Vijandren (@Vijandren)",
  "email_hash": "9237eb4c4945baf35eb84185404d3402",
  "url": "http://twitter.com/Vijandren",
  "date": "2017-11-25 11:28:57",
  "content": "Dear Keith,\n\nI wrote a long post on this issue, but decided not to publish it to drag this along any further. So will just leave this comment here to clear things up.\n\n1. There are two definitions of the word manipulate. If you look it up in the dictionary (or via google), the first definition is - to handle or control (a tool, mechanism, information, etc.) in a skillful manner. So you might want to re-read my statement with the above in mind.\n\n2. You did a fantastic job in setting up the site, server-less and all, but your haste to launch it was your ultimate downfall. You covered all the bases as far as the architecture and functionality of the site, because you are well versed in it, but you failed to cover all the other issues that comes with putting up a site like that for public consumption.\n\n3. The data you obtained is about 3-4 generations older then the copies we had (we checked). You should know well enough how easily data degrades when the file sizes are above 1GB, especially in CSV/TSV formats. Add in compression + decompression, and download sites that aren't exactly the best in the world and you end up with corrupted files. Now tell me this, can you wholeheartedly authenticate that all the data that you have put up is 100% correct?\n\n4. We had the same issue, and we had files which were in much better shape then what you had. We contacted the telcos not just for authorization, but because only the telcos are able to cross check and confirm the level of degradation of the data. When you set up something as sensitive as this, you make sure you are 100% sure you are disseminating verified information.\n\n5. We did our own checks as well - something you probably didn't. We crossed checked around 200 or so records from various telcos with immediate family and friends, and surprisingly, the accuracy was only around 70%. Sometimes the numbers and IC was correct, and the addresses were wrong, and sometimes the IC's appeared on other numbers which didn't belong to them. The fact that the IC numbers appearing on postpaid numbers made us investigate further - calling up the numbers only to confirm that the individuals using the numbers have had it for many many years.\n\n6.  When you first shared with me the site, i never imagined you were going to launch it almost immediately. The site was live and viral before i could share with you any of our findings. And then there was the whole issue of people finding numbers they didn't register appearing beside their name and so on. So yes, our main cause of concern with the site was that the data wasn't validated, and it was going to cause a lot of confusion - which neither you or me will be able to give them any concrete answer.\n\n7. Say for example, do you want to be held responsible for a domestic dispute if a wife keys in her husbands MyKad number and it shows he has a few additional numbers under his name that she is not aware of? If the numbers are indeed real, then its their problem, but if it is not, then you become liable for the dispute - because you do not have the means to verify the authenticity of the data that you disclosed. Did you put any kind of disclaimer with regards to this - i don't think so.\n\n7. The final issue is the site doesn't solve the actual problem. All it does is make people panic even more, without any avenue on what to do. Are you able to do anything more then say 'stay safe malaysia' after you tell a user that all his data is exposed? No you can't. The authorities need to draw up a proper guideline, before releasing the information - because people need to know what they can do, and what is being done to ensure their safety by the people who actually hold the keys to the door.\n\nWith great power comes great responsibility. While i do commend your heart and effort in putting up the site, in your rush to get this out there, you did not spend enough time to make sure that all the bases were covered."
}