{
  "id": "1317",
  "author": "kar2on",
  "email_hash": "3743d64fa7e8ec113f11194ead85e862",
  "url": null,
  "date": "2015-01-10 22:54:00",
  "content": "Thanks for the comment.\n\n\nWell first off, the Mongols taking over without violence, is because people were afraid of what they did when they actually DID use violence. It wasn't as though people willingly wanted to be conquered by Genghis--it was simply they were afraid of dying violently at the hands of a Mongol with a BATTLE AXE, chopping off their heads. Go read what Mongols would do to the inhabitants (innocent bystanders) of a city after it was sieged and then tell me what City wouldn't give up the instant the Mongols arrived.\n\n\nAnd Yes, Genghis Khan and Mongols in general were quite religiously tolerant, but people forget that the a lot of Polytheist like the Mongols were VERY religiously tolerant by Monotheistic standards. The Mongols believed in their Gods and never expected anyone else to believe in them, simply because at the time Gods were tied to their locality, and people from other localities weren't expected to worship Gods from elsewhere. This of course in stark contradiction to Monotheist who usually expected everyone to worship their God--and hence the religiously intolerant. The only thing Genghis Khan didn't like was people not paying their taxes--other than that they could worship anyone they damn pleased.\n\n\nAnd in terms of Genghis being intelligent--I fully agree. most Military Historians accept him (instead of Alexander or Napoleon) as the greatest Military General in all of human history--and you don't get there by being stupid. \n\n\nBut he wasn't progressive.At least not a progressive kick-starter of the world. He destroyed much of the Abissid empire (well technically his grandson Hulagu)--but it was said that the \"Rivers ran black from the ink of the manuscripts\" that they threw into the river. Which was probably a HUGE amount of knowledge at the time because the Abissids led the world in Science and Technology (not counting contemporary China of course)\n\n\nIn the end though if ISIS conquers the planet--I'd hate to be anyone. But they won't--and in most cases that's not their real purpose either. I use to think that ISIS was really bad, but after a while I realize their just that regions response to the current situation. The real solution for Iraq would be a 3-country solution with the Kurds, Shia and Sunnis each getting their piece of the pie--once that happens all the support ISIS currently gets will dwindle, and we'll move on to something else. ISIS is sort of the Sunni Army, in response to Peshmerga forces for the Kurds and the Iraqi army consisting mostly of Shia's--once the war ends, there's no need for the army."
}