{
  "id": "809",
  "author": "IT.Sheiss",
  "email_hash": "e8a62fa5bfbbc46d8cc39b2b00e5e054",
  "url": null,
  "date": "2013-05-17 16:04:00",
  "content": "I couldn't care less whether or not Lazada, Zalora or the now defunct Home24.com.my have copied Amazon.com's business model or looks and applied it to Malaysia and neighbouring countries in South East Asia.\n\n\nInstead, I'm more concerned with whether they fulfil their promises and obligations to their customers and suppliers and judging by the comemnts here, they are not meeting their obligations and fulfiling their promises to their customers all that well, though it could be due to internal operational problems, rather than deliberate intent.\n\nI admire the fact that Lazada &amp; Zalora cater to cash on delivery and phone-in purchases, rather than just on online payment alone\n\nHaving shoped by mail order (snail mail order) as a student in the U.K. in the 1970s, mostly for vynil albums. I learned something about virtual shopping.\n\nI.E.-  That the goods sold online must either be unavailable in the local stores OR if they are, then they must be considerably cheaper online.\n\n\nLazada follows the latter model, though I have come to understand from parties which have dealings with them, that Lazada faces stiff chalelnges due to the already thin margins for consumer ICT goods and consumer electronics, so does not have that strong an advantage over your local smartphone vendor.\n\n\nOn the other hand higher margins are realised from the fashionwear items which Zalora sells.\n\n\n\nBesides vynil albums which I bought by post in the UK at around 30% less that the price in stores, I also had my film processed by mail order for about two-third of what I would have had to pay a photography processsing outlet in town.\n\n\nI also bought books by mail order from a book club for considerably less than in the book shops and fairly novel items form a mail order catalogue.\n\n\nMore recently, I have bought books online from Amazon.com ONLY because they are unavailable in local bookstores in Malaysia.\n\n\n\nI believe that it is much easier for e-commerce to take off in countries  which have had an establsihed legacy of mail-order and TV shopping, since the remote shopping culture is already well established along with the delivery ecosystem, which makes the transaition to Internet shopping that much easier.\n\n\nThus, Rocket Internet has taken a rather bold risk by introducing local online shopping in countries where an established culture for such is not all that well established.\n\n\nAs an urbanite, living in Petaling Jaya, I have not bought anything from Lazada, when Digital Mall is 10 minutes walk away, and Low Yat Plaza is a good excuse for an afternoon of window shopping.\n\n\nDunno but perhaps I'm not the only one.\n\n\nAlso, how many rural customers does Lazada actually have and does it justify the costs of servicing them?\n\n\nOn another note, I also wonder whether anybody has become an Amazon.com local agent, which takes orders and payments for books locally, aggregates them into one big order from Amazon.com to reduce shipment costs per book, then has them delivered locally to the buyers ir calls the buyers to come in and collect them.\n\n\nThat's what C. Dasaratharaj in SIngapore used to do as regional subscription agent for LIFE &amp; Time magazine subscriptions in the 1960s."
}