{
  "id": "514",
  "author": "Telekom Malaysia Sucks",
  "email_hash": "28e06f0b4cb75282da0ca5e3bb1a0516",
  "url": null,
  "date": "2012-09-24 13:06:00",
  "content": "My 1st couple of months with Unifi was living hell, but after making numerous calls and paying Unifi HQ a couple of visits, they resolved my problems and I was satisfied with the service for about 1 year or so, until the problems came back a few weeks ago. The problem with TM Unifi is not just the internet connection, but rather the attitude of the technicians they hire, and also their(TM) level of commitment and responsibility towards us, the consumers. I have been having disconnection problems for the last couple of weeks and have already had 6 report numbers created. Just imagine, having to call them(Unifi 1300881221 - not toll free but chargable calls) every 3-4 days for the last couple of weeks, only to hear lies after lies of them having already resolved the problem. \n\nJust on Saturday(22-9-12) I made another report and as usual, another report number was created for me. Later that day I received a call from one of their technicians, checking with me if my internet connection was ok. I told him that the connection was still not stable, and he agreed to come to my place today(Monday 24-9-12). I made myself available and waited the whole morning, expecting at the very least a call from the technician, but no call and no one showed up. I got tired of waiting and decided to give Unifi another call, only to find out that the report has already been closed without anyone from their side even bothering to inform me. At this point I almost used the \"f\" word while I was talking to the Unifi phone operator, but had to try and calm myself down, as I knew that it wasn't the fault of the phone operator. Our Unifi problems is in fact not a Unifi problem but rather a problem with the company, the entire organization of this government link company(GLC), called Telekom Malaysia Berhad. \n\nMy advice: Stay away from anything that has got to do with TM, until they start acting more responsibly and showing more commitment towards paying consumers. Sadly I am still bound by a 24 mths contract with about 7 mths to go, and I will not hesitate to terminate my contract the very moment my contract with them expires. And although I have been using TM's services since they started offering free modems for the 1st 5000 subscribers of Streamyx, which is about 12 years ago, this time round will be the very last that I'll have anything to do with Telekom Malaysia berhad."
}