{
  "id": "2754",
  "author": "Max T. Furr",
  "email_hash": "102898dd8144ab6a44b37f08b8d4d6f8",
  "url": "http://thebenevolentthou.wordpress.com",
  "date": "2017-10-25 23:28:19",
  "content": "Keith, why would you want any book banned, especially <i>The God Delusion?</i> Isn't it time for the world to rise from its ancient cloister of ignorance and face the world with courage and honesty? Why fear knowledge?\n\nContrary to what many religions teach (especially the Abrahamic religions) they are not a uniting force, but instead they drive the Balkanization of populations and cultures and make war much easier.\n\nOne's religious beliefs is, most often, a matter of happenstance. Its all a matter of where one is born—into which society, which religion, which family. A child is born neither Christian, nor Jew, nor Muslim, nor atheist, nor an adherent to any other brand of religious or philosophical order. A child is born a human being with an ability to learn and from this raw material society builds her walls of prejudice, nationalism and religious certitude.\n\nOne may say that the problem is only fundamentalism, but it is <i>exclusive</i> religion, itself, that inevitably breeds fundamentalism with its thundering warhorses of ignorance, xenophobia and hate.\n\nAll Dawkins is doing is to point out fundamental facts of logic and physics. Sound's cold? No. It's exciting to discover new things and to dispel mind-blocking myth. Dawkins encourage people to understand that we are basically all the same, made of the same stuff, but growing up in different societies and cultures, being taught our particular myths that form in us a sense of territorial imperative that must be defended.\n\nWe are capable of reason. We need to use it to closely examine all beliefs with boldness. Sure, postulate the existence of (s). Even believe such a being to be true. But, what then? Build a life of prejudice, nationalism and religious certitude based on that one idea?\n\n<blockquote>Fix reason firmly in her seat, and call to her tribunal every fact, every opinion. Question with boldness even the existence of a god; because, if there be one, he must approve the homage of reason rather than of blindfolded fear. (Thomas Jefferson, Letter to Peter Carr, 10 Aug. 1787, Lower case \"g\" in \"god\" retained)</blockquote>"
}