{
  "id": "3486",
  "author": "Michelle",
  "email_hash": "6c886f0acaeb63f9bfb608a8df68de57",
  "url": null,
  "date": "2019-08-27 16:31:35",
  "content": "Here is my story - adding on the the many of your who are frustrated and lost of hope \n\n-13 December, we called Unifi for info on a new subscription. I guess it was fair to say that we received the information we needed. \n-14 December, we called back to clarify on a few items - then was suprised that what ever information received on 13/12 was not accurate.\n- 15 December, I personally called to speak with a personnel there, no suprises, i got some very different information from the previous 2 calls. Mariam, the person on the phone told me that there is a promo going on - that if i applied through the internet, i will get 1 month's free subscription. I was told that someone will get back to me within 3 days to get details from me and installation will be done within the next 3-7 working days.\n- 16 December, I applied online happily and eager awaited for TM to call. 17/12 - no call, 18/12 - no call, 21/12 - no call\n- 21 December : since I didnt receive any calls and have very little faith in our local operator's way of doing things, i decided to give a call to follow up. Apparently they dont have our company name in the system as a new subsciber...Nevermind, so we confirmed it again. On the same day, a guy by the name of Firdaus called and wanted to confirm the address of our office to check if there is good line reception (which was already done during my call on the 15th). I felt this call was pointless just to check for line reception. He then said that someone will be in touch either today or tomorrow.\n- 22 December : waited and no calls from TM. Being worried as time is no friend of mine (we need the internet running asap as we have moved offices and we rely heavily on the net) i decided to call them instead. Apparently, they couldnt find our company subscription (which was not a good sign) \n- 22 - 24 December was 3 grueling days where i had to spend my time chasing these idiots as they couldnt give any solution, said they will call me back but ALWAYS never did, could not give me a timeline, never kept up to their promises and blah blah blah.  \n- 28 - 30 December : i was suprised when this guy called Kamal called on 28/12 from TM which i was happy to receive his call - but then got furious when his purpose was just to inform me that someone will be in touch with me!!! How stupid can TM's customer service process be that this cannot be simplified and enhanced to ensure customer satisfaction???\nThese 3 days, i had to waste time calling, chasing, and speaking with imbeciles to get my case sorted out. Today, it has been 2 wednesdays since i last applied online. Where the hell is promise their SLAs?? Today i literally fired 2 guys over the phone, kamal and Shahrol to get someone to sort this case out by TODAY. Kamal did however promised me that he would..........however, its all BS!\n\nMoral of the story - if you need good service, reliable internet connectivity, bring your business somewhere else"
}