{
  "id": "3459",
  "author": "Choo",
  "email_hash": "7caaf78520a55db845972ad01e2a117c",
  "url": "https://www.keithrozario.com/2012/02/email-ceo-restore-unifi-services.html",
  "date": "2019-08-27 16:17:53",
  "content": "Dear Dato,\n\nI am new IPTV fibre connection subscriber as I came to know all maxis/Astro Fibre are supplied by TM net known to be one of the fastest connectivity so far. I made an appointment weeks before Raya and was told the installation can only made on 25th, July. \nHere's where my nightmare starts,\n\n25th July 12pm - a Chinese technician came over while the house owner was told it needs at least 4 holes to be punched on wall, the wires needs to cross over 1 bedroom to dining room which my house owner resists to carry on installation. Based on the technician feedback there s no port in front of my house which is why the installation need to carry on all the way from back door to dining hall(18*65sqf house)I managed to convince the house owner in the end to install without any consideration how far it may impact my house, the technician somehow was caught in the raining when he promised to come back after installation opposite my neighbor. The technician said just called helpline and he will fix afterwards. \nI made call on 25th July, 31st July, and 1st Aug requesting installation since I was told there will be cancellation penalty of rm200. Without being told any reason not any followup call done, after I follow up with IPTV on TM technician updates, no answer and updates given! \nOn 1st aug, I receive IPTV Helpdesk Informed the updates from TM stating they are having port issue, it takes 20 days to have new ports set up before installation can be made. I urge for a definite answer as it's been long waiting and I have been using mobile to access internet for work and personal usage over 3 weeks and the billing is piling up! \n5 August, I request and updates if someone can call me back by 7aug so that I could make a decision if to carry on other ISP. I was told to wait without a definite answer if the port will be set up as in waiting timeline. No body called me, I called and same answer given. Still I have been asked to pay rm200 penalty if I decide not to carry on installation. \n10th aug, my 5th follow up answer from IPTV stating no answer from TM net and they can't confirm if could cancel my installation request without penalty! \nOut of frustration of more than 3 weeks waiting and wasting my mobile coverage, I am here seeking for TM to look into this as I can't hold this any longer if anyone can seriously look into this area - PUJ 6/15 Taman Puncak jalil and provide a definite fixing date &#038; solution!\n\nThanks!"
}