{
  "id": "3511",
  "author": "yan",
  "email_hash": "1219cc0e31ae7a669ec0021a4f94a74a",
  "url": null,
  "date": "2019-08-27 16:53:19",
  "content": "I'm having the 30mbs package paying RM189 for the last few years. Staying in 1st Floor apartment. I've opted to disconnect Astro since HyppTv is available in the package. Little did I know... I think I have been ripped off for the longest time by TM. I'm not that IT savvy, as long as there is a connection I'm okay with it. The thing is, the line has been from bad to worst and I just could not take it anymore. The last couple of weeks the wifi keep dropping and HyppTv is not available... its like you are watching a broken CD!\n\nSo I googled of course on how to do speed test bla bla bla... lo and behold... the download and upload reading was sooo bad it made my eyes turn red. What they promised is download speed of 30mbs and upload speed of 10mbs, right... but no.. it was from the range from 12.6/9.43 to 8.61/7.64mbps... so you see... all this while this was what I'm getting.\n\nOf course then I called TM CC and of course they asked me to reboot which I told them I did that like 10000 time already and one more time you tell me that I will kill you... well... then she passed to Technical dept... and they did take my complaint.. that was on 7/12. Since I have to go out of town on the weekend, the technician called me and told me that they did something externally and change a port or something I can't remember. (I must say that their respond to this was fast)\n\nThey said they will call me on Monday to see whether my connection is already okay or not. On Sunday when I came back, thank God there was a connection though I think its still slow, but at least i can watch the TV. Then I did the speed test again, still the same. And of course the connection again went crazy and Hypptv too. And of course no one call me on Monday, just only today Wednesday.\n\nSo, today I went to their website and saw their latest package of 100mbps for RM129!!!!! Say what?! Of course again I called the CC which i have to wait to almost an hour to speak to the rep. I told them I wanted that since your 30mbs package is sooo bad... and the answer... not available for hi-rise building... OMG!!\nhow is that fair huh?! Then the rep told me we have another package at RM119 same for whatever I'm getting now except phone call will be charge at RM0.20 p/m. If I wish to change, my contract have to be renewed. Oh no!!! But stupidly I agreed!!! Because anyway I do not used the landline much. And at the same time I complaint again about the unifi terrible horrible connection. So... although I got to save RM70 and the technician hopefully will come and have a look at the problem/s...I'm still in despair......."
}